---
kind: type
id: T:Autodesk.Revit.Exceptions.ArgumentsInconsistentException
source: html/05972c68-fa6d-3a83-d720-ad84fbc4780f.htm
---
# Autodesk.Revit.Exceptions.ArgumentsInconsistentException

The exception that is thrown when each individual argument is OK, but a joint constraint is violated.

## Syntax (C#)
```csharp
[SerializableAttribute]
public class ArgumentsInconsistentException : ArgumentException
```